// pages/newsForAI/newsForAI.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    newsContent:["农民人数减少，国内粮食产量下降，农村土地经营权流转在进行。土地本归于农民承包经营，后转让与别人经营但农民承包不变。这可使土地集中，更好实现机械化。食品要关注它的来源，需要保障食品产品能够有食物供应。","伴随着经济发展，社会个体对于享受资料消费的需求日渐升高，食品成为最简单的享乐消费的类别。不过食品产业已经有一部分人做，可能会面临比较严峻的竞争形势。不过这个可以从白手起家，不一定要太高的成本"],
    policyContent:["国家不断推进农业的经营权集中于一人身上的过程。这是解决农业现代化的惟一办法。流转之后可以促进现代化，但是考虑到这涉及到权利问题，目前多坚持自主性原则，推进过程可能仍需要一定时间.","《食品安全法》中指出立法目的：为了保证食品安全，保障公众身体健康和生命安全。所以国家致力于保障所有的人民的粮食安全，避免食品安全事故。目前国家的视频出于安全状态，但是民众的安全意识仍呈现出过于敏感的状态。"]
  },

  navigateTo_gameP1:function(){
    wx.redirectTo({
      url: '/pages/gameP1/gameP1',
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})