// pages/newsForAI/newsForAI.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    newsContent:["A国现已具有相当全面的AI产品与相关教育课程，使其领先于世界各国，当下的众人对于VR、AR等产品极为看重，把他们当作了最具吸引力 产品。作为一名对AI技术很了解并且希望做出可以增强现实视觉效果的设备的企业家，你希望组建团队建立一个AR（增强现实技术）的公司。","在AI技术趋于成熟的情况下，越来越多的领域对于AI的需求更加迫切，无人机更是其中的佼佼者，不仅运用在探测方面，也在运输、导航等多方面起到至关重要的作用。于是，身为有志青年的你，带着一身机器人知识投身创新准备开一家无人车公司"],
    policyContent:["A国政府对于科技发展极为重视，并且设立了科研专项投资，对于新建立的公司可以减去30%的税务。各个大公司也表示愿意对自己中意的新型企业实行人才共享，提供一定的人脉资源。","该国家政府对于创业者有很高的期望，于是对于创业公司提供资金补贴，其中包括创业培训补贴、一次性补贴、创业场地补贴等等。政府还推出了金融信贷优惠包括创业担保贷、小微创业贷等。最后还出台了税收优惠政策"]
  },

  navigateTo_gameP1:function(){
    wx.redirectTo({
      url: '/pages/gameP1/gameP1',
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})