// pages/newsForAI/newsForAI.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    newsContent:["21世纪，游戏这个项目已经普及度非常高了，其中暴雪魔兽世界等掌控力极强的游戏也已经运行于巅峰期，你，是一个对游戏创作非常痴迷的企业家，在之前的经验引导下，你认定游戏市场绝对是当下的最好选择之一。","在游戏普及的过程中，出现了多种多样的形式，街机、电脑、手机等等，但是最方便且集中的无疑是游戏机和街机游戏厅，而你正是看中了集中的特点选择了创立一家游戏机公司。"],
    policyContent:["公司向各高校的计算机学科学生实行优先考虑原则，先行进行面试并且给予一定程度的奖励基于额外工作量。同时国家也号召各个高校扩招计算机AI学科学生，并且倡导校企联合有助于公司发展也有助于学生就业问题的解决。最后国家也出台了关于培训教育补贴的相关政策。","政府对于新企业有着一定的优惠政策，首先，从最基本的原料，政府的关税可以进行适当的下调，下调大小基于购进的花销而定。其次，政府对于公司的选址也有照顾，如果地址是郊区，政府愿意把地皮的价格打折并在公司有一定规模后在分期无利润还。"]
  },

  navigateTo_gameP1:function(){
    wx.redirectTo({
      url: '/pages/gameP1/gameP1',
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})